In [1]:
import pandas as pd
import numpy as np

# If then

In [2]:
df = pd.DataFrame(
    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)


df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [3]:
df_mask = pd.DataFrame(
    {"AAA": [True] * 4, "BBB": [False] * 4, "CCC": [True, False] * 2}
)

df_mask

    AAA    BBB    CCC
0  True  False   True
1  True  False  False
2  True  False   True
3  True  False  False

In [7]:
# Use pandas where after youâ€™ve set up a mask
df.where(df_mask, -1000)

   AAA   BBB   CCC
0    4 -1000   100
1    5 -1000 -1000
2    6 -1000   -30
3    7 -1000 -1000

In [8]:
df = pd.DataFrame(
    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)


df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [9]:
aValue = 43.0

In [19]:
(df.CCC - aValue).abs().argmin()

np.int64(1)

In [20]:
# Reordering and reindexing the DataFrame
df.loc[(df.CCC - aValue).abs().argsort()]

   AAA  BBB  CCC
1    5   20   50
0    4   10  100
2    6   30  -30
3    7   40  -50

# SPlitting

In [22]:
df = pd.DataFrame(
    {"AAA": [4, 5, 6, 7], "BBB": [10, 20, 30, 40], "CCC": [100, 50, -30, -50]}
)


Crit1 = df.AAA <= 5.5

Crit2 = df.BBB == 10.0

Crit3 = df.CCC > -40.0

In [23]:
AllCrit = Crit1 & Crit2 & Crit3

In [25]:
print(df[AllCrit])

   AAA  BBB  CCC
0    4   10  100

In [26]:
import functools

CritList = [Crit1, Crit2, Crit3]

AllCrit = functools.reduce(lambda x, y: x & y, CritList)

df[AllCrit]

   AAA  BBB  CCC
0    4   10  100

In [34]:
# Efficiently and dynamically creating new columns using DataFrame.map (previously named applymap)

df = pd.DataFrame({"AAA": [1, 2, 1, 3], "BBB": [1, 1, 2, 2], "CCC": [2, 1, 3, 1]})

df

   AAA  BBB  CCC
0    1    1    2
1    2    1    1
2    1    2    3
3    3    2    1

In [35]:
source_cols = df.columns

new_cols = [str(x) + "_cat" for x in source_cols]

categories = {1: "alpha", 2:"beta", 3:"charlie"}

df[new_cols] = df[source_cols].map(categories.get)

In [33]:
df

   AAA  BBB  CCC  AAA_cat BBB_cat  CCC_cat AAA_cat_cat BBB_cat_cat CCC_cat_cat
0    1    1    2    alpha   alpha     beta        None        None        None
1    2    1    1     beta   alpha    alpha        None        None        None
2    1    2    3    alpha    beta  charlie        None        None        None
3    3    2    1  charlie    beta    alpha        None        None        None

# Grouping

In [36]:
df = pd.DataFrame(
    {
        "animal": "cat dog cat fish dog cat cat".split(),
        "size": list("SSMMMLL"),
        "weight": [8, 10, 11, 1, 20, 12, 12],
        "adult": [False] * 5 + [True] * 2,
    }
)


df

  animal size  weight  adult
0    cat    S       8  False
1    dog    S      10  False
2    cat    M      11  False
3   fish    M       1  False
4    dog    M      20  False
5    cat    L      12   True
6    cat    L      12   True

In [43]:
df.groupby("animal").apply(lambda x: x['size'][x['weight'].idxmax()])

/tmp/ipykernel_5250/1412685957.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby("animal").apply(lambda x: x['size'][x['weight'].idxmax()])

animal
cat     L
dog     M
fish    M
dtype: object

In [45]:
df.groupby("animal").get_group("cat")

  animal size  weight  adult
0    cat    S       8  False
2    cat    M      11  False
5    cat    L      12   True
6    cat    L      12   True

# Pivot

In [47]:
grades = [48, 99, 75, 80, 42, 80, 72, 68, 36, 78]

df = pd.DataFrame(
    {
        "ID": ["x%d" % r for r in range(10)],
        "Gender": ["F", "M", "F", "M", "F", "M", "F", "M", "M", "M"],
        "ExamYear": [
            "2007",
            "2007",
            "2007",
            "2008",
            "2008",
            "2008",
            "2008",
            "2009",
            "2009",
            "2009",
        ],
        "Class": [
            "algebra",
            "stats",
            "bio",
            "algebra",
            "algebra",
            "stats",
            "stats",
            "algebra",
            "bio",
            "bio",
        ],
        "Participated": [
            "yes",
            "yes",
            "yes",
            "yes",
            "no",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
        ],
        "Passed": ["yes" if x > 50 else "no" for x in grades],
        "Employed": [
            True,
            True,
            True,
            False,
            False,
            False,
            False,
            True,
            True,
            False,
        ],
        "Grade": grades,
    }
)

In [48]:
df

   ID Gender ExamYear    Class Participated Passed  Employed  Grade
0  x0      F     2007  algebra          yes     no      True     48
1  x1      M     2007    stats          yes    yes      True     99
2  x2      F     2007      bio          yes    yes      True     75
3  x3      M     2008  algebra          yes    yes     False     80
4  x4      F     2008  algebra           no     no     False     42
5  x5      M     2008    stats          yes    yes     False     80
6  x6      F     2008    stats          yes    yes     False     72
7  x7      M     2009  algebra          yes    yes      True     68
8  x8      M     2009      bio          yes     no      True     36
9  x9      M     2009      bio          yes    yes     False     78

In [53]:
print(df.groupby(["ExamYear", "Class"]).agg(
    {
        "Participated": lambda x: x.value_counts()['yes'],
        "Passed": lambda x: sum(x == "yes"),
        "Employed": lambda x: sum(x),
        "Grade": lambda x: sum(x) / len(x),

    }
)
)

                  Participated  Passed  Employed  Grade
ExamYear Class
2007     algebra             1       0         1   48.0
         bio                 1       1         1   75.0
         stats               1       1         1   99.0
2008     algebra             1       1         0   61.0
         stats               2       2         0   76.0
2009     algebra             1       1         1   68.0
         bio                 2       1         1   57.0

# Correlaation

In [56]:
df = pd.DataFrame(np.random.random(size=(100, 5)))

corr_mat = df.corr()

mask = np.tril(np.ones_like(corr_mat, dtype=np.bool_), k=-1)

print(corr_mat.where(mask).fillna(''))

          0         1         2         3 4
0
1  0.066331
2 -0.125251  0.076066
3 -0.033523 -0.013753  0.111436
4  0.021613 -0.030334 -0.346397 -0.034375

In [64]:
np.tril(np.ones_like(corr_mat, dtype=np.bool_), k=-1)

array([[False, False, False, False, False],
       [ True, False, False, False, False],
       [ True,  True, False, False, False],
       [ True,  True,  True, False, False],
       [ True,  True,  True,  True, False]])